workloads/YCSB_rocksdb/luma_test_logs/workloadF_logs/xfs_1dev_f
<YCSB RocksDB benchmark script>
load YCSB-f x1 & run YCSB-f x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 65237
[OVERALL], Throughput(ops/sec), 15.328724496834619
[TOTAL_GCS_G1_Young_Generation], Count, 114
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 488
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7480417554455294
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 114
[TOTAL_GC_TIME], Time(ms), 488
[TOTAL_GC_TIME_%], Time(%), 0.7480417554455294
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 15252.109375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 975871
[CLEANUP], 95thPercentileLatency(us), 16
[CLEANUP], 99thPercentileLatency(us), 27
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 3955531.264
[INSERT], MinLatency(us), 1003008
[INSERT], MaxLatency(us), 5382143
[INSERT], 95thPercentileLatency(us), 4964351
[INSERT], 99thPercentileLatency(us), 5206015
[INSERT], Return=OK, 1000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 112705
[OVERALL], Throughput(ops/sec), 8.872720819839405
[TOTAL_GCS_G1_Young_Generation], Count, 101
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2107
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8694822767401624
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 101
[TOTAL_GC_TIME], Time(ms), 2107
[TOTAL_GC_TIME_%], Time(%), 1.8694822767401624
[READ], Operations, 1000
[READ], AverageLatency(us), 702190.648
[READ], MinLatency(us), 22544
[READ], MaxLatency(us), 4571135
[READ], 95thPercentileLatency(us), 2275327
[READ], 99thPercentileLatency(us), 3008511
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 513
[READ-MODIFY-WRITE], AverageLatency(us), 1.2076672499025341E7
[READ-MODIFY-WRITE], MinLatency(us), 409344
[READ-MODIFY-WRITE], MaxLatency(us), 50561023
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 39124991
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 49315839
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6153.546875
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 392447
[CLEANUP], 95thPercentileLatency(us), 50
[CLEANUP], 99thPercentileLatency(us), 85
[UPDATE], Operations, 513
[UPDATE], AverageLatency(us), 1.1321590144249512E7
[UPDATE], MinLatency(us), 234624
[UPDATE], MaxLatency(us), 49086463
[UPDATE], 95thPercentileLatency(us), 38862847
[UPDATE], 99thPercentileLatency(us), 48168959
[UPDATE], Return=OK, 513
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 82529
[OVERALL], Throughput(ops/sec), 12.116952828702638
[TOTAL_GCS_G1_Young_Generation], Count, 255
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2311
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.8002277987131796
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 255
[TOTAL_GC_TIME], Time(ms), 2311
[TOTAL_GC_TIME_%], Time(%), 2.8002277987131796
[READ], Operations, 1000
[READ], AverageLatency(us), 724158.084
[READ], MinLatency(us), 15656
[READ], MaxLatency(us), 4118527
[READ], 95thPercentileLatency(us), 2379775
[READ], 99thPercentileLatency(us), 3807231
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 478
[READ-MODIFY-WRITE], AverageLatency(us), 9123855.263598327
[READ-MODIFY-WRITE], MinLatency(us), 312576
[READ-MODIFY-WRITE], MaxLatency(us), 28098559
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 24543231
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 26623999
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9378.75
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 599039
[CLEANUP], 95thPercentileLatency(us), 61
[CLEANUP], 99thPercentileLatency(us), 70
[UPDATE], Operations, 478
[UPDATE], AverageLatency(us), 8393309.857740587
[UPDATE], MinLatency(us), 203392
[UPDATE], MaxLatency(us), 27049983
[UPDATE], 95thPercentileLatency(us), 23707647
[UPDATE], 99thPercentileLatency(us), 25739263
[UPDATE], Return=OK, 478
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 84842
[OVERALL], Throughput(ops/sec), 11.786615119869875
[TOTAL_GCS_G1_Young_Generation], Count, 218
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2420
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.8523608590085097
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 218
[TOTAL_GC_TIME], Time(ms), 2420
[TOTAL_GC_TIME_%], Time(%), 2.8523608590085097
[READ], Operations, 1000
[READ], AverageLatency(us), 748699.152
[READ], MinLatency(us), 24336
[READ], MaxLatency(us), 4055039
[READ], 95thPercentileLatency(us), 1999871
[READ], 99thPercentileLatency(us), 3201023
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 520
[READ-MODIFY-WRITE], AverageLatency(us), 8267190.4
[READ-MODIFY-WRITE], MinLatency(us), 381440
[READ-MODIFY-WRITE], MaxLatency(us), 23707647
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 20414463
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 22953983
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10247.59375
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 654847
[CLEANUP], 95thPercentileLatency(us), 41
[CLEANUP], 99thPercentileLatency(us), 42
[UPDATE], Operations, 520
[UPDATE], AverageLatency(us), 7505236.553846153
[UPDATE], MinLatency(us), 237056
[UPDATE], MaxLatency(us), 22527999
[UPDATE], 95thPercentileLatency(us), 19202047
[UPDATE], 99thPercentileLatency(us), 21905407
[UPDATE], Return=OK, 520
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 85993
[OVERALL], Throughput(ops/sec), 11.628853511332318
[TOTAL_GCS_G1_Young_Generation], Count, 86
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1554
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8071238356610422
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 86
[TOTAL_GC_TIME], Time(ms), 1554
[TOTAL_GC_TIME_%], Time(%), 1.8071238356610422
[READ], Operations, 1000
[READ], AverageLatency(us), 887478.592
[READ], MinLatency(us), 17824
[READ], MaxLatency(us), 4419583
[READ], 95thPercentileLatency(us), 2189311
[READ], 99thPercentileLatency(us), 2885631
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 482
[READ-MODIFY-WRITE], AverageLatency(us), 7867161.493775934
[READ-MODIFY-WRITE], MinLatency(us), 531456
[READ-MODIFY-WRITE], MaxLatency(us), 24608767
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 19169279
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 20545535
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 28243.796875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 1806335
[CLEANUP], 95thPercentileLatency(us), 65
[CLEANUP], 99thPercentileLatency(us), 363
[UPDATE], Operations, 482
[UPDATE], AverageLatency(us), 6962612.315352697
[UPDATE], MinLatency(us), 342528
[UPDATE], MaxLatency(us), 23724031
[UPDATE], 95thPercentileLatency(us), 18382847
[UPDATE], 99thPercentileLatency(us), 19988479
[UPDATE], Return=OK, 482
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 82877
[OVERALL], Throughput(ops/sec), 12.066073820239632
[TOTAL_GCS_G1_Young_Generation], Count, 223
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2721
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 3.2831786864872035
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 223
[TOTAL_GC_TIME], Time(ms), 2721
[TOTAL_GC_TIME_%], Time(%), 3.2831786864872035
[READ], Operations, 1000
[READ], AverageLatency(us), 857050.784
[READ], MinLatency(us), 25008
[READ], MaxLatency(us), 5791743
[READ], 95thPercentileLatency(us), 2918399
[READ], 99thPercentileLatency(us), 4345855
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 506
[READ-MODIFY-WRITE], AverageLatency(us), 8342440.221343873
[READ-MODIFY-WRITE], MinLatency(us), 498176
[READ-MODIFY-WRITE], MaxLatency(us), 21528575
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 18366463
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 21004287
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 17238.671875
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 1101823
[CLEANUP], 95thPercentileLatency(us), 61
[CLEANUP], 99thPercentileLatency(us), 264
[UPDATE], Operations, 506
[UPDATE], AverageLatency(us), 7516323.667984189
[UPDATE], MinLatency(us), 305920
[UPDATE], MaxLatency(us), 20807679
[UPDATE], 95thPercentileLatency(us), 17711103
[UPDATE], 99thPercentileLatency(us), 19365887
[UPDATE], Return=OK, 506
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 83097
[OVERALL], Throughput(ops/sec), 12.034128789246303
[TOTAL_GCS_G1_Young_Generation], Count, 229
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2425
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.9182762313922286
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 229
[TOTAL_GC_TIME], Time(ms), 2425
[TOTAL_GC_TIME_%], Time(%), 2.9182762313922286
[READ], Operations, 1000
[READ], AverageLatency(us), 702581.976
[READ], MinLatency(us), 23088
[READ], MaxLatency(us), 3377151
[READ], 95thPercentileLatency(us), 1878015
[READ], 99thPercentileLatency(us), 3164159
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 478
[READ-MODIFY-WRITE], AverageLatency(us), 9164328.30125523
[READ-MODIFY-WRITE], MinLatency(us), 202496
[READ-MODIFY-WRITE], MaxLatency(us), 26509311
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 21495807
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 24510463
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8361.578125
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 534015
[CLEANUP], 95thPercentileLatency(us), 61
[CLEANUP], 99thPercentileLatency(us), 79
[UPDATE], Operations, 478
[UPDATE], AverageLatency(us), 8437338.10878661
[UPDATE], MinLatency(us), 151424
[UPDATE], MaxLatency(us), 25395199
[UPDATE], 95thPercentileLatency(us), 21135359
[UPDATE], 99thPercentileLatency(us), 23855103
[UPDATE], Return=OK, 478
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 82506
[OVERALL], Throughput(ops/sec), 12.120330642619932
[TOTAL_GCS_G1_Young_Generation], Count, 81
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1528
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8519865221923255
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 81
[TOTAL_GC_TIME], Time(ms), 1528
[TOTAL_GC_TIME_%], Time(%), 1.8519865221923255
[READ], Operations, 1000
[READ], AverageLatency(us), 923258.872
[READ], MinLatency(us), 16768
[READ], MaxLatency(us), 4171775
[READ], 95thPercentileLatency(us), 2318335
[READ], 99thPercentileLatency(us), 3207167
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 490
[READ-MODIFY-WRITE], AverageLatency(us), 7685606.13877551
[READ-MODIFY-WRITE], MinLatency(us), 140544
[READ-MODIFY-WRITE], MaxLatency(us), 16941055
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 13074431
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 15892479
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 25261.234375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 1615871
[CLEANUP], 95thPercentileLatency(us), 83
[CLEANUP], 99thPercentileLatency(us), 135
[UPDATE], Operations, 490
[UPDATE], AverageLatency(us), 6755515.102040816
[UPDATE], MinLatency(us), 123328
[UPDATE], MaxLatency(us), 15998975
[UPDATE], 95thPercentileLatency(us), 12320767
[UPDATE], 99thPercentileLatency(us), 14983167
[UPDATE], Return=OK, 490
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 82371
[OVERALL], Throughput(ops/sec), 12.140194971531242
[TOTAL_GCS_G1_Young_Generation], Count, 129
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2011
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.4413932087749326
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 129
[TOTAL_GC_TIME], Time(ms), 2011
[TOTAL_GC_TIME_%], Time(%), 2.4413932087749326
[READ], Operations, 1000
[READ], AverageLatency(us), 855277.24
[READ], MinLatency(us), 17536
[READ], MaxLatency(us), 3205119
[READ], 95thPercentileLatency(us), 2609151
[READ], 99thPercentileLatency(us), 3055615
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 489
[READ-MODIFY-WRITE], AverageLatency(us), 8302906.110429448
[READ-MODIFY-WRITE], MinLatency(us), 473600
[READ-MODIFY-WRITE], MaxLatency(us), 17104895
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 14090239
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 15958015
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 2716.6875
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 172671
[CLEANUP], 95thPercentileLatency(us), 59
[CLEANUP], 99thPercentileLatency(us), 109
[UPDATE], Operations, 489
[UPDATE], AverageLatency(us), 7401872.883435583
[UPDATE], MinLatency(us), 253824
[UPDATE], MaxLatency(us), 15597567
[UPDATE], 95thPercentileLatency(us), 13484031
[UPDATE], 99thPercentileLatency(us), 14499839
[UPDATE], Return=OK, 489
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 66241
[OVERALL], Throughput(ops/sec), 15.096390453042677
[TOTAL_GCS_G1_Young_Generation], Count, 80
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1578
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.3822104134901343
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 80
[TOTAL_GC_TIME], Time(ms), 1578
[TOTAL_GC_TIME_%], Time(%), 2.3822104134901343
[READ], Operations, 1000
[READ], AverageLatency(us), 850024.04
[READ], MinLatency(us), 19168
[READ], MaxLatency(us), 3774463
[READ], 95thPercentileLatency(us), 2217983
[READ], 99thPercentileLatency(us), 3291135
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 493
[READ-MODIFY-WRITE], AverageLatency(us), 6287635.862068965
[READ-MODIFY-WRITE], MinLatency(us), 182016
[READ-MODIFY-WRITE], MaxLatency(us), 14704639
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 9551871
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 12566527
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10984.484375
[CLEANUP], MinLatency(us), 8
[CLEANUP], MaxLatency(us), 701439
[CLEANUP], 95thPercentileLatency(us), 79
[CLEANUP], 99thPercentileLatency(us), 113
[UPDATE], Operations, 493
[UPDATE], AverageLatency(us), 5426701.371196754
[UPDATE], MinLatency(us), 154624
[UPDATE], MaxLatency(us), 12075007
[UPDATE], 95thPercentileLatency(us), 8585215
[UPDATE], 99thPercentileLatency(us), 10764287
[UPDATE], Return=OK, 493
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 97988
[OVERALL], Throughput(ops/sec), 10.205331265052864
[TOTAL_GCS_G1_Young_Generation], Count, 250
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2740
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.796260766624485
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 250
[TOTAL_GC_TIME], Time(ms), 2740
[TOTAL_GC_TIME_%], Time(%), 2.796260766624485
[READ], Operations, 1000
[READ], AverageLatency(us), 787114.368
[READ], MinLatency(us), 16688
[READ], MaxLatency(us), 4739071
[READ], 95thPercentileLatency(us), 2662399
[READ], 99thPercentileLatency(us), 4259839
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 506
[READ-MODIFY-WRITE], AverageLatency(us), 1.0556172648221344E7
[READ-MODIFY-WRITE], MinLatency(us), 530432
[READ-MODIFY-WRITE], MaxLatency(us), 35160063
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 32604159
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 34603007
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 15159.84375
[CLEANUP], MinLatency(us), 9
[CLEANUP], MaxLatency(us), 969215
[CLEANUP], 95thPercentileLatency(us), 40
[CLEANUP], 99thPercentileLatency(us), 70
[UPDATE], Operations, 506
[UPDATE], AverageLatency(us), 9795909.56521739
[UPDATE], MinLatency(us), 327424
[UPDATE], MaxLatency(us), 34275327
[UPDATE], 95thPercentileLatency(us), 32194559
[UPDATE], 99thPercentileLatency(us), 33718271
[UPDATE], Return=OK, 506
*---------------------------------- ycsb run end ------------------------------*
experiment end.